piyonchu/smart-ir-ac-remote-stm32/IRsender/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <ctype.h>
#include <stdlib.h>
#include "pv_st_f411.h"
#include "stm32f4xx_hal.h"

// --- PORCUPINE INCLUDES ---
#include "pv_picovoice.h"
#include "keyword_params.h" // Your Alexa/Keyword header
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef enum {
    IR_IDLE = 0,
    IR_SENDING_MARK,
    IR_SENDING_SPACE
} IR_State_t;

typedef struct {
    uint16_t mark_us;
    uint16_t space_us;
} IR_Pulse_t;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
// --- AUDIO CONFIG ---
#define SAMPLE_RATE 16000
#define FRAME_SIZE 512
#define CHANNELS 2
#define I2S_BUFFER_SIZE (FRAME_SIZE * CHANNELS * 2)
#define MEMORY_BUFFER_SIZE (1024 * 43)

// --- DAIKIN / HW CONFIG ---
#define DHT11_PORT GPIOB
#define DHT11_PIN  GPIO_PIN_0

#define DAIKIN176_HDR_MARK      5070
#define DAIKIN176_HDR_SPACE     2140
#define DAIKIN176_BIT_MARK      370
#define DAIKIN176_ONE_SPACE     1780
#define DAIKIN176_ZERO_SPACE    710
#define DAIKIN176_GAP           29410
#define DAIKIN176_STATE_LENGTH  22
#define DAIKIN176_SECTION1_LEN  7
#define MAX_PULSES              300

// AC Constants
#define DAIKIN176_MODE_FAN      0
#define DAIKIN176_MODE_HEAT     1
#define DAIKIN176_MODE_COOL     2
#define DAIKIN176_MODE_AUTO     3
#define DAIKIN176_MODE_DRY      7

#define DAIKIN176_FAN_LOW       1
#define DAIKIN176_FAN_MED       2
#define DAIKIN176_FAN_HIGH      3
#define DAIKIN176_SWING_AUTO    0x5
#define DAIKIN176_SWING_OFF     0x6
#define DAIKIN176_DRY_FAN_TEMP  17
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CRC_HandleTypeDef hcrc;

I2S_HandleTypeDef hi2s2;
DMA_HandleTypeDef hdma_spi2_rx;

TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim5;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

osThreadId defaultTaskHandle;
osThreadId AudioTaskHandle;
osThreadId ControlTaskHandle;
osMessageQId commandQueueHandle;
/* USER CODE BEGIN PV */
int __io_putchar(int ch) {
    HAL_UART_Transmit(&huart2, (uint8_t *)&ch, 1, 10);
    return ch;
}

// --- HARDWARE HANDLES ---
TIM_HandleTypeDef htim3; // Manually added as it was missing in generated code

// --- AUDIO DATA ---
uint16_t i2s_rx_buffer[I2S_BUFFER_SIZE];
int16_t mono_pcm_buffer[FRAME_SIZE];
volatile uint8_t half_transfer_flag = 0;
volatile uint8_t full_transfer_flag = 0;

//static const char* ACCESS_KEY = "1tRtNkoHDZntOJsz9hWww1pEZ7Ox8nzMBa14btCoTyUTSTBFRxgd/A==";
static const char* ACCESS_KEY = "cTKsua4o2+I4XCobOlBW3ujPKjrQAV8W6ZoyLiBfsdZgJbtYkuPqZQ==";
static uint8_t memory_buffer[MEMORY_BUFFER_SIZE] __attribute__((aligned(16)));
// Picovoice Objects
pv_picovoice_t *picovoice_handle = NULL;

// Parameters
static const float PORCUPINE_SENSITIVITY = 0.75f;
static const float RHINO_SENSITIVITY = 0.5f;
static const float RHINO_ENDPOINT_DURATION_SEC = 0.5f;
static const bool RHINO_REQUIRE_ENDPOINT = true;

// --- AC / UART DATA ---
uint8_t rx_buffer[1];
char msg_buffer[50];
int msg_index = 0;
volatile uint8_t msg_ready = 0;
char tx_buffer[200];

// AC Internal State
uint8_t ac_power = 0;
uint8_t ac_mode = DAIKIN176_MODE_COOL;
uint8_t ac_fan = DAIKIN176_FAN_MED;
uint8_t ac_temp = 25;
uint8_t ac_swing = 0;

uint8_t R_H, R_D, T_H, T_D, Sum;

// IR State
uint8_t daikin176_state[DAIKIN176_STATE_LENGTH] = {
    0x11, 0xDA, 0x17, 0x18, 0x04, 0x00, 0xC4,
    0x11, 0xDA, 0x17, 0x18, 0x00, 0x73, 0x00,
    0x20, 0x00, 0x00, 0x32, 0x60, 0x00, 0x00, 0x00
};
volatile IR_State_t ir_state = IR_IDLE;
volatile IR_Pulse_t pulse_buffer[MAX_PULSES];
volatile uint16_t pulse_count = 0;
volatile uint16_t pulse_index = 0;
volatile bool ir_busy = false;

// DHT11
uint8_t temp_int = 0, hum_int = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_I2S2_Init(void);
static void MX_CRC_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM3_Init(void);
void StartDefaultTask(void const * argument);
void StartAudioTask(void const * argument);
void StartControlTask(void const * argument);

/* USER CODE BEGIN PFP */

void AC_SetMode(uint8_t mode);
void AC_SetFan(uint8_t speed);
void AC_SetSwing(uint8_t on);
const char* AC_GetModeString(uint8_t mode);
const char* AC_GetFanString(uint8_t fan);
bool IR_IsBusy(void);
// AC/IR Functions
void AC_SetPower(uint8_t on);
void AC_SetTemp(uint8_t temp);
void AC_SendCommand(void);
void AC_UpdateState(void);
void IR_BuildDaikin176(void);
void IR_StartTransmission(void);
void IR_AddPulse(uint16_t mark_us, uint16_t space_us);
uint8_t IR_CalculateChecksum(uint8_t *data, uint8_t length);
uint8_t DHT11_Read_Data(void);
void DWT_Delay_us(volatile uint32_t microseconds);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
bool flagOn = 1;

