piyonchu/smart-ir-ac-remote-stm32/IRsender/Core/Src/main.c
// Enum for Queue Commands
enum {
    CMD_NONE = 0,
    CMD_WAKE_WORD_DETECTED,
    CMD_UART_MSG_READY,
    // Voice Commands
    CMD_AC_ON, CMD_AC_OFF,
    CMD_FAN_LOW, CMD_FAN_MED, CMD_FAN_HIGH,
    CMD_MODE_COOL, CMD_MODE_DRY, CMD_MODE_FAN,
    CMD_TEMP_WARMER, CMD_TEMP_COOLER,
    CMD_SWING_ON, CMD_SWING_OFF
};

// Helper to find slot value in inference result
const char* get_slot_value(pv_inference_t *inference, const char* slot_name) {
    for (int i = 0; i < inference->num_slots; i++) {
        if (strcmp(inference->slots[i], slot_name) == 0) {
            return inference->values[i];
        }
    }
    return NULL;
}
static void wake_word_callback(void) {
    char uart_buf[64]; // Buffer for the message
    int len;

    // Visual feedback
    HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);

    // Format and Send
    len = sprintf(uart_buf, "[Wake Word Detected]\r\n");
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);
}

static void inference_callback(pv_inference_t *inference) {
    char uart_buf[256]; // Larger buffer for JSON data
    int len;

    HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);

    // 1. Open Bracket
    len = sprintf(uart_buf, "{\r\n");
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);

    // 2. Is Understood
    len = sprintf(uart_buf, "    is_understood : '%s',\r\n", (inference->is_understood ? "true" : "false"));
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);

    if (inference->is_understood) {
        // 3. Intent
        len = sprintf(uart_buf, "    intent : '%s',\r\n", inference->intent);
        HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);

        if (inference->num_slots > 0) {
            // 4. Slots Header
            len = sprintf(uart_buf, "    slots : {\r\n");
            HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);

            // 5. Iterate Slots
            for (int32_t i = 0; i < inference->num_slots; i++) {
                len = sprintf(uart_buf, "        '%s' : '%s',\r\n", inference->slots[i], inference->values[i]);
                HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);
            }

            // 6. Close Slots
            len = sprintf(uart_buf, "    }\r\n");
            HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);
        }
    }

    // 7. Close JSON
    len = sprintf(uart_buf, "}\r\n\r\n");
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);

    uint8_t command_to_send = CMD_NONE;

        if (inference->is_understood) {
            if (strcmp(inference->intent, "changePower") == 0) {
                const char* state = get_slot_value(inference, "ac_state");
                if (state) {
                    if (strcmp(state, "on") == 0) command_to_send = CMD_AC_ON;
                    else if (strcmp(state, "off") == 0) command_to_send = CMD_AC_OFF;
                }
            }
            else if (strcmp(inference->intent, "changeFan") == 0) {
                const char* speed = get_slot_value(inference, "fan_speed");
                if (speed) {
                    if (strcmp(speed, "low") == 0) command_to_send = CMD_FAN_LOW;
                    else if (strcmp(speed, "med") == 0) command_to_send = CMD_FAN_MED;
                    else if (strcmp(speed, "high") == 0) command_to_send = CMD_FAN_HIGH;
                }
            }
            else if (strcmp(inference->intent, "changeMode") == 0) {
                const char* mode = get_slot_value(inference, "ac_mode");
                if (mode) {
                    if (strcmp(mode, "cool") == 0) command_to_send = CMD_MODE_COOL;
                    else if (strcmp(mode, "dry") == 0) command_to_send = CMD_MODE_DRY;
                    else if (strcmp(mode, "fan") == 0) command_to_send = CMD_MODE_FAN;
                }
            }
            else if (strcmp(inference->intent, "changeTemp") == 0) {
                const char* temp = get_slot_value(inference, "temperature");
                if (temp) {
                    if (strcmp(temp, "warmer") == 0) command_to_send = CMD_TEMP_WARMER;
                    else if (strcmp(temp, "cooler") == 0) command_to_send = CMD_TEMP_COOLER;
                }
            }
            else if (strcmp(inference->intent, "changeSwing") == 0) {
                const char* state = get_slot_value(inference, "ac_state");
                if (state) {
                    if (strcmp(state, "on") == 0) command_to_send = CMD_SWING_ON;
                    else if (strcmp(state, "off") == 0) command_to_send = CMD_SWING_OFF;
                }
            }
        }

        // Send the mapped command to the Control Task
        if (command_to_send != CMD_NONE) {
            osMessagePut(commandQueueHandle, command_to_send, 0);
        }
    pv_inference_delete(inference);
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
	//pv_board_init();

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART2_UART_Init();
  MX_I2S2_Init();
  MX_CRC_Init();
  MX_USART1_UART_Init();
  MX_TIM5_Init();
  MX_TIM3_Init();
  /* USER CODE BEGIN 2 */
  DWT_Delay_Init();


  const int32_t lib_frame_len = pv_picovoice_frame_length();

       char uart_buf[64]; // Buffer for UART messages
       int len;

       // Check if there is a mismatch at startup
       if (lib_frame_len != FRAME_SIZE) {
           len = sprintf(uart_buf, "CRITICAL WARNING: Lib wants %ld samples, but DMA is %d\r\n", lib_frame_len, FRAME_SIZE);
           HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);
           // If you see this warning, you MUST change #define FRAME_SIZE in main.h
       } else {
           len = sprintf(uart_buf, "Audio Task Started. Frame Len: %ld\r\n", lib_frame_len);
           HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);
       }


