piyonchu/smart-ir-ac-remote-stm32/IRsender/Core/Src/main.c
       int32_t required_memory = 0;

           // We use the existing 'memory_buffer' as the scratchpad (preliminary buffer)
           pv_status_t mem_status = pv_picovoice_get_min_memory_buffer_size(
               MEMORY_BUFFER_SIZE,      // 1. Preliminary Size (Your max buffer)
               memory_buffer,           // 2. Preliminary Buffer Pointer
               sizeof(KEYWORD_ARRAY),   // 3. Keyword Size
               KEYWORD_ARRAY,           // 4. Keyword Model
               sizeof(CONTEXT_ARRAY),   // 5. Context Size
               CONTEXT_ARRAY,           // 6. Context Model
               &required_memory         // 7. Output: The actual size needed
           );

           if (mem_status != PV_STATUS_SUCCESS) {
               char err_buf[64];
               int l = sprintf(err_buf, "PV Mem Check Fail: %s\r\n", pv_status_to_string(mem_status));
               HAL_UART_Transmit(&huart2, (uint8_t*)err_buf, l, 100);
               Error_Handler();
           }

           // Print the result to UART
           char mem_msg[64];
           int l = sprintf(mem_msg, "PV RAM Needed: %ld bytes\r\n", required_memory);
           HAL_UART_Transmit(&huart2, (uint8_t*)mem_msg, l, 100);

           // Verify we have enough space
           if (required_memory > MEMORY_BUFFER_SIZE) {
               char err_msg[] = "ERROR: MEMORY_BUFFER_SIZE too small!\r\n";
               HAL_UART_Transmit(&huart2, (uint8_t*)err_msg, strlen(err_msg), 100);
               Error_Handler();
           }
  // 1. Initialize Manual Hardware (TIM3 & DWT)


    // 2. RE-CONFIGURE TIM5 for 38kHz (Your generated code set it to MAX)
    // Assuming 72MHz or 84MHz clock. This sets period to ~26us
    __HAL_TIM_SET_PRESCALER(&htim5, 0);
    __HAL_TIM_SET_AUTORELOAD(&htim5, 2210); // Adjust based on your APB1 clock!
    __HAL_TIM_SET_COMPARE(&htim5, TIM_CHANNEL_2, 1105); // 50% Duty
    pv_board_init();
     const uint8_t *board_uuid = pv_get_uuid();
//
//    	char uart_buf[64];
//    	int len;
//
//    	// 1. Print Opening Separator
//    	len = sprintf(uart_buf, "\r\n============================\r\n");
//    	HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);
//
//    	// 2. Print UUID Label
//    	len = sprintf(uart_buf, "UUID: ");
//    	HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);
//
//    	// 3. Print UUID Bytes Loop
//    	for (uint32_t i = 0; i < pv_get_uuid_size(); i++) {
//    	    len = sprintf(uart_buf, " %.2x", board_uuid[i]);
//    	    HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);
//    	}
//
//    	// 4. Print Closing Separator
//    	len = sprintf(uart_buf, "\r\n============================\r\n");
//    	HAL_UART_Transmit(&huart2, (uint8_t*)uart_buf, len, 100);
    printf("\r\n============================\r\n");

        printf("UUID: ");

        for (uint32_t i = 0; i < pv_get_uuid_size(); i++) {

            printf(" %.2x", board_uuid[i]);

        }

        printf("\r\n============================\r\n");

        // 3. Picovoice Init (Replaces Porcupine Init)
            pv_status_t status = pv_picovoice_init(
                    ACCESS_KEY,
                    MEMORY_BUFFER_SIZE,
                    memory_buffer,
                    sizeof(KEYWORD_ARRAY),
                    KEYWORD_ARRAY,
                    PORCUPINE_SENSITIVITY,
                    wake_word_callback,
                    sizeof(CONTEXT_ARRAY),
                    CONTEXT_ARRAY,
                    RHINO_SENSITIVITY,
                    RHINO_ENDPOINT_DURATION_SEC,
                    RHINO_REQUIRE_ENDPOINT,
                    inference_callback,
                    &picovoice_handle);

            if (status != PV_STATUS_SUCCESS) {
                char err_msg[64];
                sprintf(err_msg, "PV INIT FAIL: %s\r\n", pv_status_to_string(status));
                HAL_UART_Transmit(&huart2, (uint8_t*)err_msg, strlen(err_msg), 100);
                Error_Handler();
            } else {
                // Print Context Info for debugging
                const char *rhino_context = NULL;
                pv_picovoice_context_info(picovoice_handle, &rhino_context);
                printf("Context: %s\r\n", rhino_context);
            }

    // 4. Start Listening
    AC_UpdateState();
    IR_BuildDaikin176();
    HAL_UART_Receive_IT(&huart1, rx_buffer, 1);
    HAL_I2S_Receive_DMA(&hi2s2, i2s_rx_buffer, I2S_BUFFER_SIZE);

    // 5. Create RTOS Objects
//    osMessageQDef(cmdQ, 5, uint8_t);
//    commandQueueHandle = osMessageCreate(osMessageQ(cmdQ), NULL);
//
//    osThreadDef(AudioTask, StartAudioTask, osPriorityAboveNormal, 0, 4096);
//    AudioTaskHandle = osThreadCreate(osThread(AudioTask), NULL);
//
//    osThreadDef(ControlTask, StartControlTask, osPriorityNormal, 0, 1024);
//    ControlTaskHandle = osThreadCreate(osThread(ControlTask), NULL);

    char msg[] = "\r\nstarting\r\n";
                            HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 100);

    // Note: We ignore defaultTask created below, it will just yield.
  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the queue(s) */
  /* definition and creation of commandQueue */
  osMessageQDef(commandQueue, 10, uint8_t);
  commandQueueHandle = osMessageCreate(osMessageQ(commandQueue), NULL);

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 128);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of AudioTask */
  osThreadDef(AudioTask, StartAudioTask, osPriorityNormal, 0, 10240);
  AudioTaskHandle = osThreadCreate(osThread(AudioTask), NULL);

