piyonchu/smart-ir-ac-remote-stm32/IRsender/Core/Src/main.c
}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

  /* USER CODE BEGIN USART2_Init 0 */

  /* USER CODE END USART2_Init 0 */

  /* USER CODE BEGIN USART2_Init 1 */

  /* USER CODE END USART2_Init 1 */
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART2_Init 2 */

  /* USER CODE END USART2_Init 2 */

}

/**
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void)
{

  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Stream3_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : B1_Pin */
  GPIO_InitStruct.Pin = B1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LD2_Pin */
  GPIO_InitStruct.Pin = LD2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LD2_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
// --- TASKS ---


// --- CALLBACKS ---

void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s) { half_transfer_flag = 1; }
void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s) { full_transfer_flag = 1; }

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
    if (huart->Instance == USART1) {
        char received = (char)rx_buffer[0];

        // Check for Newline or Carriage Return
        if (received == '\n' || received == '\r') {
            // ONLY process if we actually have data in the buffer
            if (msg_index > 0) {
                msg_buffer[msg_index] = '\0'; // Null terminate the string
                msg_index = 0;                // Reset index IMMEDIATELY to prevent double trigger

                // Send to queue
                osMessagePut(commandQueueHandle, CMD_UART_MSG_READY, 0);
            }
            // If msg_index is 0, it means we just processed the \r,
            // so we ignore the following \n.
        }
        else {
            // It's a normal character, add to buffer
            if (msg_index < 49) {
                msg_buffer[msg_index++] = received;
            }
        }

        // Restart Interrupt
        HAL_UART_Receive_IT(&huart1, rx_buffer, 1);
    }
}


void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
    if (htim->Instance == TIM3) {
        if (ir_state == IR_SENDING_MARK) {
            HAL_TIM_PWM_Stop(&htim5, TIM_CHANNEL_2);
            if (pulse_buffer[pulse_index].space_us > 0) {
                ir_state = IR_SENDING_SPACE;
                __HAL_TIM_SET_COUNTER(&htim3, 0);
                __HAL_TIM_SET_AUTORELOAD(&htim3, pulse_buffer[pulse_index].space_us);
            } else {
                HAL_TIM_Base_Stop_IT(&htim3);
                ir_state = IR_IDLE;
                ir_busy = false;
            }
        } else if (ir_state == IR_SENDING_SPACE) {
            pulse_index++;
            if (pulse_index >= pulse_count) {
                HAL_TIM_Base_Stop_IT(&htim3);
                ir_state = IR_IDLE;
                ir_busy = false;
            } else {
                ir_state = IR_SENDING_MARK;
                HAL_TIM_PWM_Start(&htim5, TIM_CHANNEL_2);
                __HAL_TIM_SET_COUNTER(&htim3, 0);
                __HAL_TIM_SET_AUTORELOAD(&htim3, pulse_buffer[pulse_index].mark_us);
            }
        }
    }
}


void Set_Pin_Output(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = GPIO_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOx, &GPIO_InitStruct);
}

void Set_Pin_Input(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = GPIO_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOx, &GPIO_InitStruct);
}
// AC Helper Functions
void AC_SetMode(uint8_t mode) {
    ac_mode = mode;
}

void AC_SetFan(uint8_t speed) {
    if (speed >= DAIKIN176_FAN_LOW && speed <= DAIKIN176_FAN_HIGH) {
        ac_fan = speed;
    }
}

void AC_SetSwing(uint8_t on) {
    ac_swing = on ? 1 : 0;
}

const char* AC_GetModeString(uint8_t mode) {
    switch (mode) {
        case DAIKIN176_MODE_COOL: return "cool";
        case DAIKIN176_MODE_HEAT: return "heat";
        case DAIKIN176_MODE_AUTO: return "auto";
        case DAIKIN176_MODE_DRY:  return "dry";
        case DAIKIN176_MODE_FAN:  return "fan";
        default: return "unknown";
    }
}

const char* AC_GetFanString(uint8_t fan) {
    switch (fan) {
        case DAIKIN176_FAN_LOW:  return "low";
        case DAIKIN176_FAN_MED:  return "medium";
        case DAIKIN176_FAN_HIGH: return "high";
        default: return "unknown";
    }
}

bool IR_IsBusy(void) {
    return ir_busy;
}
// --- AC IMPLEMENTATION ---

void AC_SetPower(uint8_t on) { ac_power = on ? 1 : 0; }
void AC_SetTemp(uint8_t temp) { if(temp >= 18 && temp <= 32) ac_temp = temp; }

