piyonchu/smart-ir-ac-remote-stm32/IRsender/Core/Src/main.c
void AC_UpdateState(void) {
    daikin176_state[14] = (ac_power & 0x01) | ((ac_mode & 0x07) << 4);
    uint8_t temp_val = (ac_mode == DAIKIN176_MODE_DRY || ac_mode == DAIKIN176_MODE_FAN) ? DAIKIN176_DRY_FAN_TEMP : ac_temp;
    daikin176_state[17] = (daikin176_state[17] & 0x81) | ((temp_val & 0x3F) << 1);
    uint8_t swing_val = ac_swing ? DAIKIN176_SWING_AUTO : DAIKIN176_SWING_OFF;
    daikin176_state[18] = (swing_val & 0x0F) | ((ac_fan & 0x0F) << 4);
}

void IR_BuildDaikin176(void) {
    pulse_count = 0;
    // Calculate Checksums
    uint8_t sum1 = 0; for(int i=0; i<6; i++) sum1 += daikin176_state[i]; daikin176_state[6] = sum1;
    uint8_t sum2 = 0; for(int i=7; i<21; i++) sum2 += daikin176_state[i]; daikin176_state[21] = sum2;

    IR_AddPulse(DAIKIN176_HDR_MARK, DAIKIN176_HDR_SPACE);
    for (uint8_t i = 0; i < DAIKIN176_SECTION1_LEN; i++) {
        uint8_t byte = daikin176_state[i];
        for (uint8_t bit = 0; bit < 8; bit++) {
            IR_AddPulse(DAIKIN176_BIT_MARK, (byte & 0x01) ? DAIKIN176_ONE_SPACE : DAIKIN176_ZERO_SPACE);
            byte >>= 1;
        }
    }
    IR_AddPulse(DAIKIN176_BIT_MARK, DAIKIN176_GAP);
    IR_AddPulse(DAIKIN176_HDR_MARK, DAIKIN176_HDR_SPACE);
    for (uint8_t i = DAIKIN176_SECTION1_LEN; i < DAIKIN176_STATE_LENGTH; i++) {
        uint8_t byte = daikin176_state[i];
        for (uint8_t bit = 0; bit < 8; bit++) {
            IR_AddPulse(DAIKIN176_BIT_MARK, (byte & 0x01) ? DAIKIN176_ONE_SPACE : DAIKIN176_ZERO_SPACE);
            byte >>= 1;
        }
    }
    IR_AddPulse(DAIKIN176_BIT_MARK, 0);
}

void IR_StartTransmission(void) {
    if (ir_busy) return;
    ir_busy = true;
    pulse_index = 0;
    ir_state = IR_SENDING_MARK;
    HAL_TIM_PWM_Start(&htim5, TIM_CHANNEL_2);
    __HAL_TIM_SET_COUNTER(&htim3, 0);
    __HAL_TIM_SET_AUTORELOAD(&htim3, pulse_buffer[0].mark_us);
    HAL_TIM_Base_Start_IT(&htim3);
}

void IR_AddPulse(uint16_t mark_us, uint16_t space_us) {
    if (pulse_count < MAX_PULSES) {
        pulse_buffer[pulse_count].mark_us = mark_us;
        pulse_buffer[pulse_count].space_us = space_us;
        pulse_count++;
    }
}

void AC_SendCommand(void) { AC_UpdateState(); IR_BuildDaikin176(); IR_StartTransmission(); }


void DWT_Delay_Init(void) {
    if (!(CoreDebug->DEMCR & CoreDebug_DEMCR_TRCENA_Msk)) {
        CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
        DWT->CYCCNT = 0;
        DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
    }
}

// DHT11 Helper (Simple DWT)
void DWT_Delay_us(volatile uint32_t microseconds) {
    uint32_t clk_cycle_start = DWT->CYCCNT;
    microseconds *= (HAL_RCC_GetHCLKFreq() / 1000000);
    while ((DWT->CYCCNT - clk_cycle_start) < microseconds);
}

void DHT11_Start(void) {
    Set_Pin_Output(DHT11_PORT, DHT11_PIN);
    HAL_GPIO_WritePin(DHT11_PORT, DHT11_PIN, 0);

    // CHANGE: Use osDelay instead of HAL_Delay to let AudioTask run during this long wait
    osDelay(18);

    HAL_GPIO_WritePin(DHT11_PORT, DHT11_PIN, 1);
    DWT_Delay_us(20);
    Set_Pin_Input(DHT11_PORT, DHT11_PIN);
}

// Helper to read with timeout
// Returns -1 on timeout, 0 or 1 on success
int Wait_For_Pin_State(GPIO_TypeDef* port, uint16_t pin, GPIO_PinState state, uint32_t timeout_iters) {
    while (HAL_GPIO_ReadPin(port, pin) != state) {
        if (timeout_iters-- == 0) return -1;
    }
    return 0;
}

uint8_t DHT11_Check_Response(void) {
    uint8_t response = 0;
    DWT_Delay_us(40);

    // Add timeouts to these checks
    if (!(HAL_GPIO_ReadPin(DHT11_PORT, DHT11_PIN))) {
        DWT_Delay_us(80);
        if ((HAL_GPIO_ReadPin(DHT11_PORT, DHT11_PIN))) response = 1;
    }

    // Safety timeout prevents infinite loop
    if (Wait_For_Pin_State(DHT11_PORT, DHT11_PIN, GPIO_PIN_RESET, 10000) < 0) return 0; // Error

    return response;
}

uint8_t DHT11_Read_Byte(void) {
    uint8_t i = 0, j;
    for (j = 0; j < 8; j++) {
        // Wait for pin to go high (start of bit) with timeout
        if(Wait_For_Pin_State(DHT11_PORT, DHT11_PIN, GPIO_PIN_SET, 10000) < 0) return 0; // Timeout error

        DWT_Delay_us(40);

        if (!(HAL_GPIO_ReadPin(DHT11_PORT, DHT11_PIN))) {
            i &= ~(1 << (7 - j));
        } else {
            i |= (1 << (7 - j));
        }

        // Wait for pin to go low (end of bit) with timeout
        if(Wait_For_Pin_State(DHT11_PORT, DHT11_PIN, GPIO_PIN_RESET, 10000) < 0) return 0; // Timeout error
    }
    return i;
}

uint8_t DHT11_Read_Data(void) {
    // 1. Send Start Signal (Allow context switching here via osDelay)
    DHT11_Start();

    // 2. Enter Critical Section
    // We DISABLE interrupts so AudioTask cannot interrupt the sensitive timing
    taskENTER_CRITICAL();

    if (DHT11_Check_Response()) {
        R_H = DHT11_Read_Byte();
        R_D = DHT11_Read_Byte();
        T_H = DHT11_Read_Byte();
        T_D = DHT11_Read_Byte();
        Sum = DHT11_Read_Byte();

        // 3. Exit Critical Section immediately after reading
        taskEXIT_CRITICAL();

        if (Sum == (R_H + R_D + T_H + T_D)) {
            temp_int = T_H;
            hum_int = R_H;
            return 1;
        }
    } else {
        // Ensure we exit critical section even if response failed
        taskEXIT_CRITICAL();
    }
    return 0;
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartAudioTask */
/**
* @brief Function implementing the AudioTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartAudioTask */
void StartAudioTask(void const * argument)
{
  /* USER CODE BEGIN StartAudioTask */
    // Helper buffer to make code cleaner
    int16_t *src_buffer = NULL;



    while(1) {
        bool process = false;

        // 1. Check DMA Flags
        if (half_transfer_flag) {
            half_transfer_flag = 0;
            src_buffer = (int16_t *)&i2s_rx_buffer[0];
            process = true;
        } else if (full_transfer_flag) {
            full_transfer_flag = 0;
            src_buffer = (int16_t *)&i2s_rx_buffer[I2S_BUFFER_SIZE / 2];
            process = true;
        }

        if (process && src_buffer) {
            // 2. CRITICAL FIX: Convert Stereo (L/R) to Mono (L only)
            for (int i = 0; i < FRAME_SIZE; i++) {
                // Takes every 2nd sample.
                mono_pcm_buffer[i] = src_buffer[i * 2];
            }

