piyonchu/smart-ir-ac-remote-stm32/IRsender/Core/Src/main.c
            // 3. Process with Picovoice (using the cleaned MONO buffer)
            pv_status_t status = pv_picovoice_process(picovoice_handle, mono_pcm_buffer);

            if (status != PV_STATUS_SUCCESS) {
                // Optional: Print error only if it's not a standard "empty" frame
            	char msg[] = "\r\nProcess Work failed\r\n";
            	            	HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 100);
            } else {
            	char msg[] = "\r\nProcess Working\r\n";
            	HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 100);
            }
        }
        osDelay(1);
    }
  /* USER CODE END StartAudioTask */
}

/* USER CODE BEGIN Header_StartControlTask */
/**
* @brief Function implementing the ControlTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartControlTask */
void StartControlTask(void const * argument)
{
  /* USER CODE BEGIN StartControlTask */
    osEvent evt;
    while(1) {
        evt = osMessageGet(commandQueueHandle, 200); // 200ms wait
        if (evt.status == osEventMessage) {
            uint8_t cmd = (uint8_t)evt.value.v;
            uint8_t send_ir = 0;
            if (cmd == CMD_WAKE_WORD_DETECTED) {
            	if (flagOn) {
            		AC_SetPower(1);
            		                AC_SendCommand();
            		                flagOn = !flagOn;
            		                sprintf(tx_buffer, "{\"ac\":\"wake-word\",\"power\":\"on\"}\r\n");
            	} else {
            		AC_SetPower(0);
            		                AC_SendCommand();
            		                flagOn = !flagOn;
            		                sprintf(tx_buffer, "{\"ac\":\"wake-word\",\"power\":\"off\"}\r\n");
            	}


                HAL_UART_Transmit(&huart2, (uint8_t*)tx_buffer, strlen(tx_buffer), 100);
                HAL_UART_Transmit(&huart1, (uint8_t*)tx_buffer, strlen(tx_buffer), 100);
            }
            else if (cmd == CMD_AC_ON) {
                            AC_SetPower(1);
                            send_ir = 1;
                            sprintf(tx_buffer, "{\"ac\":\"power-on\",\"source\":\"voice\"}\r\n");
                        }
                        else if (cmd == CMD_AC_OFF) {
                            AC_SetPower(0);
                            send_ir = 1;
                            sprintf(tx_buffer, "{\"ac\":\"power-off\",\"source\":\"voice\"}\r\n");
                        }
                        else if (cmd == CMD_FAN_LOW) {
                            AC_SetFan(DAIKIN176_FAN_LOW);
                            send_ir = 1;
                            sprintf(tx_buffer, "{\"ac\":\"fan-low\",\"source\":\"voice\"}\r\n");
                        }
                        else if (cmd == CMD_FAN_MED) {
                            AC_SetFan(DAIKIN176_FAN_MED);
                            send_ir = 1;
                            sprintf(tx_buffer, "{\"ac\":\"fan-med\",\"source\":\"voice\"}\r\n");
                        }
                        else if (cmd == CMD_FAN_HIGH) {
                            AC_SetFan(DAIKIN176_FAN_HIGH);
                            send_ir = 1;
                            sprintf(tx_buffer, "{\"ac\":\"fan-high\",\"source\":\"voice\"}\r\n");
                        }
                        else if (cmd == CMD_MODE_COOL) {
                            AC_SetMode(DAIKIN176_MODE_COOL);
                            send_ir = 1;
                            sprintf(tx_buffer, "{\"ac\":\"mode-cool\",\"source\":\"voice\"}\r\n");
                        }
                        else if (cmd == CMD_MODE_DRY) {
                            AC_SetMode(DAIKIN176_MODE_DRY);
                            send_ir = 1;
                            sprintf(tx_buffer, "{\"ac\":\"mode-dry\",\"source\":\"voice\"}\r\n");
                        }
                        else if (cmd == CMD_MODE_FAN) {
                            AC_SetMode(DAIKIN176_MODE_FAN);
                            send_ir = 1;
                            sprintf(tx_buffer, "{\"ac\":\"mode-fan\",\"source\":\"voice\"}\r\n");
                        }
                        else if (cmd == CMD_SWING_ON) {
                            AC_SetSwing(1);
                            send_ir = 1;
                            sprintf(tx_buffer, "{\"ac\":\"swing-on\",\"source\":\"voice\"}\r\n");
                        }
                        else if (cmd == CMD_SWING_OFF) {
                            AC_SetSwing(0);
                            send_ir = 1;
                            sprintf(tx_buffer, "{\"ac\":\"swing-off\",\"source\":\"voice\"}\r\n");
                        }
                        else if (cmd == CMD_TEMP_WARMER) {
                            if (ac_temp < 32) {
                                AC_SetTemp(ac_temp + 1);
                                send_ir = 1;
                                sprintf(tx_buffer, "{\"ac\":\"temp-up\",\"val\":%d,\"source\":\"voice\"}\r\n", ac_temp);
                            }
                        }
                        else if (cmd == CMD_TEMP_COOLER) {
                            if (ac_temp > 18) {
                                AC_SetTemp(ac_temp - 1);
                                send_ir = 1;
                                sprintf(tx_buffer, "{\"ac\":\"temp-down\",\"val\":%d,\"source\":\"voice\"}\r\n", ac_temp);
                            }
                        }
            else if (cmd == CMD_UART_MSG_READY) {
                for (int i = 0; msg_buffer[i]; i++) msg_buffer[i] = tolower((unsigned char)msg_buffer[i]);

                //uint8_t send_ir = 0;

                // Power commands
                if (strstr(msg_buffer, "power-on")) {
                    AC_SetPower(1);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"power-on\",\"status\":\"ok\"}\r\n");
                }
                else if (strstr(msg_buffer, "power-off")) {
                    AC_SetPower(0);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"power-off\",\"status\":\"ok\"}\r\n");
                }
                // Fan commands
                else if (strstr(msg_buffer, "fan-low")) {
                    AC_SetFan(DAIKIN176_FAN_LOW);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"fan-low\",\"status\":\"ok\"}\r\n");
                }
                else if (strstr(msg_buffer, "fan-med")) {
                    AC_SetFan(DAIKIN176_FAN_MED);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"fan-med\",\"status\":\"ok\"}\r\n");
                }
                else if (strstr(msg_buffer, "fan-high")) {
                    AC_SetFan(DAIKIN176_FAN_HIGH);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"fan-high\",\"status\":\"ok\"}\r\n");
                }
                // Mode commands
                else if (strstr(msg_buffer, "mode-cool")) {
                    AC_SetMode(DAIKIN176_MODE_COOL);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"mode-cool\",\"status\":\"ok\"}\r\n");
                }
                else if (strstr(msg_buffer, "mode-heat")) {
                    AC_SetMode(DAIKIN176_MODE_HEAT);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"mode-heat\",\"status\":\"ok\"}\r\n");
                }
                else if (strstr(msg_buffer, "mode-auto")) {
                    AC_SetMode(DAIKIN176_MODE_AUTO);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"mode-auto\",\"status\":\"ok\"}\r\n");
                }
                else if (strstr(msg_buffer, "mode-dry")) {
                    AC_SetMode(DAIKIN176_MODE_DRY);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"mode-dry\",\"status\":\"ok\"}\r\n");
                }
                else if (strstr(msg_buffer, "mode-fan")) {
                    AC_SetMode(DAIKIN176_MODE_FAN);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"mode-fan\",\"status\":\"ok\"}\r\n");
                }
                // Temperature command
                else if (strncmp(msg_buffer, "temp-", 5) == 0) {
                    int t = atoi(&msg_buffer[5]);
                    if (t >= 18 && t <= 32) {
                        AC_SetTemp((uint8_t)t);
                        send_ir = 1;
                        sprintf(tx_buffer, "{\"ac\":\"temp-%d\",\"status\":\"ok\"}\r\n", t);
                    } else {
                        sprintf(tx_buffer, "{\"ac\":\"temp\",\"error\":\"range 18-32\"}\r\n");
                    }
                }
                // Swing commands
                else if (strstr(msg_buffer, "swing-on")) {
                    AC_SetSwing(1);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"swing-on\",\"status\":\"ok\"}\r\n");
                }
                else if (strstr(msg_buffer, "swing-off")) {
                    AC_SetSwing(0);
                    send_ir = 1;
                    sprintf(tx_buffer, "{\"ac\":\"swing-off\",\"status\":\"ok\"}\r\n");
                }
                // Status command
                else if (strstr(msg_buffer, "status")) {
                    sprintf(tx_buffer,
                        "{\"power\":\"%s\",\"mode\":\"%s\",\"fan\":\"%s\",\"temp\":%d,"
                        "\"swing\":\"%s\",\"status\":\"ok\"}\r\n",
                        ac_power ? "on" : "off",
                        AC_GetModeString(ac_mode),
                        AC_GetFanString(ac_fan),
                        ac_temp,
                        ac_swing ? "on" : "off");
                }
                // DHT11 Report
                else if (strstr(msg_buffer, "report")) {
                    if (DHT11_Read_Data()) {
                        sprintf(tx_buffer,
                            "{\"temperature\":%d,\"humidity\":%d,\"unit\":\"C\",\"status\":\"ok\"}\r\n",
                            temp_int, hum_int);
                    } else {
                        sprintf(tx_buffer,
                            "{\"temperature\":null,\"humidity\":null,\"status\":\"error\"}\r\n");
                    }
                }
                else {
                    sprintf(tx_buffer, "{\"error\":\"unknown_command\"}\r\n");
                }

